//Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string str = "AnAhTgh";
str = str.ToLower();
System.Console.WriteLine(str);
